In [4]:
import pandas as pd
df = pd.read_csv("heights.csv")
df

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
9     imran    14.5
10     jose     6.1
11  deepika     5.6
12   yoseph     1.2
13    binod     5.5

In [8]:
df.describe()

          height
count  14.000000
mean    6.050000
std     2.779804
min     1.200000
25%     5.250000
50%     5.550000
75%     6.175000
max    14.500000

In [12]:
q1=df["height"].quantile(0.25)
q2=df["height"].quantile(0.5)
q3=df["height"].quantile(0.75)

In [13]:
q1,q2,q3

(5.25, 5.55, 6.175)

In [15]:
IQR= q3-q1
minl=q1-IQR*1.5
minu=q3+IQR*1.5

In [16]:
minl,minu

(3.8625000000000003, 7.5625)

In [18]:
df[(df.height<minl) | (df.height>minu)]

      name  height
9    imran    14.5
12  yoseph     1.2

In [20]:
df= df[(df.height>minl) & (df.height<minu)]
df

       name  height
0     mohan     5.9
1     maria     5.2
2     sakib     5.1
3       tao     5.5
4     virat     4.9
5    khusbu     5.4
6    dmitry     6.2
7    selena     6.5
8      john     7.1
10     jose     6.1
11  deepika     5.6
13    binod     5.5